Model: "sequential_81"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_200 (LSTM)              (None, 5, 90)             35280     
_________________________________________________________________
lstm_201 (LSTM)              (None, 5, 60)             36240     
_________________________________________________________________
lstm_202 (LSTM)              (None, 40)                16160     
_________________________________________________________________
dense_81 (Dense)             (None, 1)                 41        
=================================================================
Total params: 87,721
Trainable params: 87,721
Non-trainable params: 0
_________________________________________________________________