Model: "sequential_80"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_197 (LSTM)              (None, 5, 90)             35280     
_________________________________________________________________
lstm_198 (LSTM)              (None, 5, 60)             36240     
_________________________________________________________________
lstm_199 (LSTM)              (None, 40)                16160     
_________________________________________________________________
dense_80 (Dense)             (None, 1)                 41        
=================================================================
Total params: 87,721
Trainable params: 87,721
Non-trainable params: 0
_________________________________________________________________