Model: "sequential_78"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_191 (LSTM)              (None, 5, 90)             35280     
_________________________________________________________________
lstm_192 (LSTM)              (None, 5, 60)             36240     
_________________________________________________________________
lstm_193 (LSTM)              (None, 40)                16160     
_________________________________________________________________
dense_78 (Dense)             (None, 1)                 41        
=================================================================
Total params: 87,721
Trainable params: 87,721
Non-trainable params: 0
_________________________________________________________________